2025/Day08/Day08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-19 Fri 21:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Leo Laporte" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org79e9a19">1. &mdash; Day 8: Playground ---</a>
<ul>
<li><a href="#org747c058">1.1. Started:  Thu Dec 11 15:51:26 2025</a></li>
</ul>
</li>
<li><a href="#orgfc7ab83">2. Package Setup</a></li>
<li><a href="#orga70f006">3. Part One</a>
<ul>
<li><a href="#orgacb860f">3.1. Notes for Part One</a></li>
<li><a href="#org15b746b">3.2. Example Data</a></li>
<li><a href="#orge81e4fb">3.3. defstruct junction</a></li>
<li><a href="#org7ddfd59">3.4. parse-input()</a></li>
<li><a href="#org3696d55">3.5. dist()</a></li>
<li><a href="#orgb5d87d5">3.6. get-dists()</a></li>
<li><a href="#orge2d5b4e">3.7. sort-pairs-by-distance()</a></li>
<li><a href="#org303d083">3.8. Pause to study up on trees</a></li>
<li><a href="#orgf5a1f6e">3.9. Kruskal&rsquo;s Algorithm to the rescue</a>
<ul>
<li><a href="#org36949b7">3.9.1. Create a forest (a set of trees) initially consisting of a separate single-vertex tree for each vertex in the input graph. (DONE)</a></li>
<li><a href="#org6291f98">3.9.2. Sort the graph edges by weight. (DONE)</a></li>
<li><a href="#orgb2d3125">3.9.3. Loop through the edges of the graph, in ascending sorted order by their weight.</a></li>
</ul>
</li>
<li><a href="#org9fecde6">3.10. A Fresh Start with Union-Find</a>
<ul>
<li><a href="#org624ef7c">3.10.1. Union-Find Implementation</a></li>
<li><a href="#orgccbf431">3.10.2. get-all-edges()</a></li>
<li><a href="#orgef86212">3.10.3. kruskal()</a></li>
<li><a href="#orge93d71c">3.10.4. Solution</a></li>
<li><a href="#org8af8e54">3.10.5. Test</a></li>
<li><a href="#org1a87d7e">3.10.6. Part one finished: Sat Dec 13 16:00:55 2025</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4969b31">4. Part Two</a>
<ul>
<li><a href="#orge19b607">4.1. Notes</a></li>
<li><a href="#org38ff962">4.2. Solution</a></li>
<li><a href="#orga642042">4.3. Test</a></li>
<li><a href="#orgf7727ec">4.4. Part two finished: Fri 19 Dec 2025 08:55:40 PM PST</a></li>
<li><a href="#orgac55621">4.5. Reflections</a></li>
</ul>
</li>
<li><a href="#orgd756367">5. Run Solutions and Timings</a></li>
</ul>
</div>
</div>
<p>
#+: AOC 2025 Day 8 - Playground
</p>
<div id="outline-container-org79e9a19" class="outline-2">
<h2 id="org79e9a19"><span class="section-number-2">1.</span> &mdash; Day 8: Playground ---</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org747c058" class="outline-3">
<h3 id="org747c058"><span class="section-number-3">1.1.</span> Started:  Thu Dec 11 15:51:26 2025</h3>
</div>
</div>
<div id="outline-container-orgfc7ab83" class="outline-2">
<h2 id="orgfc7ab83"><span class="section-number-2">2.</span> Package Setup</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-lisp" id="org54ef5da"><code><span style="color: #d0a070; font-style: italic;">;;;; </span><span style="color: #d0a070; font-style: italic;">Day08.lisp
</span><span style="color: #d0a070; font-style: italic;">;;;; </span><span style="color: #d0a070; font-style: italic;">2025 AOC Day 8 solution
</span><span style="color: #d0a070; font-style: italic;">;;;; </span><span style="color: #d0a070; font-style: italic;">Common Lisp solutions by Leo Laporte (with lots of help)
</span><span style="color: #d0a070; font-style: italic;">;;;; </span><span style="color: #d0a070; font-style: italic;">Started: Thu Dec 11 15:51:26 2025
</span><span style="color: #d0a070; font-style: italic;">;;;; </span><span style="color: #d0a070; font-style: italic;">Finished: Fri 19 Dec 2025 08:55:40 PM PST
</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defpackage</span> <span style="color: #b6a0ff; font-weight: bold;">:aoc.2025.day08</span>
  <span style="color: #6c6;">(</span><span style="color: #feacd0; font-weight: bold;">:use</span> <span style="color: #feacd0; font-weight: bold;">:cl</span> <span style="color: #feacd0; font-weight: bold;">:alexandria</span> <span style="color: #feacd0; font-weight: bold;">:iterate</span><span style="color: #6c6;">)</span>      <span style="color: #d0a070; font-style: italic;">; no prefix for these libraries
</span>  <span style="color: #6c6;">(</span><span style="color: #feacd0; font-weight: bold;">:local-nicknames</span>                    <span style="color: #d0a070; font-style: italic;">; short prefixes for these
</span>   <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:re</span> <span style="color: #feacd0; font-weight: bold;">:cl-ppcre</span><span style="color: #69f;">)</span>                     <span style="color: #d0a070; font-style: italic;">; regex
</span>   <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:5a</span> <span style="color: #feacd0; font-weight: bold;">:fiveam</span><span style="color: #69f;">)</span>                       <span style="color: #d0a070; font-style: italic;">; test framework
</span>   <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:sr</span> <span style="color: #feacd0; font-weight: bold;">:serapeum</span><span style="color: #69f;">)</span>                     <span style="color: #d0a070; font-style: italic;">; CL extensions
</span>   <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:tr</span> <span style="color: #feacd0; font-weight: bold;">:trivia</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>                     <span style="color: #d0a070; font-style: italic;">; pattern matching
</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">in-package</span> <span style="color: #feacd0; font-weight: bold;">:aoc.2025.day08</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span>setf 5a:*run-test-when-defined* t<span style="color: #c66;">)</span>  <span style="color: #d0a070; font-style: italic;">; test as we go
</span><span style="color: #c66;">(</span>setf 5a:*verbose-failures* t<span style="color: #c66;">)</span>       <span style="color: #d0a070; font-style: italic;">; show failing expression
</span><span style="color: #c66;">(</span>sr:toggle-pretty-print-hash-table<span style="color: #c66;">)</span>  <span style="color: #d0a070; font-style: italic;">; automatic pretty print for hashes
</span><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">declaim</span> <span style="color: #6c6;">(</span>optimize <span style="color: #69f;">(</span>debug 3<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>       <span style="color: #d0a070; font-style: italic;">; max debugging info
</span><span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">(declaim (optimize (speed 3))     ; max speed if needed
</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defparameter</span> <span style="color: #79a8ff;">*data-file*</span> <span style="color: #00c06f;">"~/cl/AOC/2025/Day08/input.txt"</span>
  <span style="color: #bfebe0; font-style: italic;">"Downloaded from the AoC problem set"</span><span style="color: #c66;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga70f006" class="outline-2">
<h2 id="orga70f006"><span class="section-number-2">3.</span> Part One</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgacb860f" class="outline-3">
<h3 id="orgacb860f"><span class="section-number-3">3.1.</span> Notes for Part One</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These numbers represent &ldquo;junction boxes&rdquo; with X Y Z coordinates in a 3D
space. We (well the elves) want to connect the junction boxes that are closest
together in a straight line (i.e. Euclidean distance). So
</p>

<p>
\[d(p,q)=\sqrt{(p_{1}-q_{1})^{2}+(p_{2}-q_{2})^{2}+(p_{3}-q_{3})^{2}}\]
</p>

<p>
Or in Lisp: (dist p q) = (sqrt (+ (expt (- xp xq) 2)  (expt (- yp yq) 2)  (expt (- zp zq) 2)
</p>

<p>
Once we connect the two closest junction boxes to form a circuit, we look for
the next two. If any are already in a circuit the new junction points are added
to that circuit. And continue until we&rsquo;ve connected all the points up to the
limit (10 for the example, 1000 for the input).
</p>

<p>
Then multiply the largest 3 circuits (by the number of junction boxes in the
circuit) to get the answer. In the example it&rsquo;s (5x4x2) or 40.
</p>

<p>
The problem asks us to &ldquo;connect together the 1000 pairs of junction boxes which
are closest together. Afterward, what do you get if you multiply together the
sizes of the three largest circuits?&rdquo;
</p>
</div>
</div>
