2025/Day08/Day08.tex
% Created 2025-12-19 Fri 22:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Leo Laporte}
\date{11 December 2025}
\title{}
\hypersetup{
 pdfauthor={Leo Laporte},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\tableofcontents

\#+: AOC 2025 Day 8 - Playground
\section{--- Day 8: Playground ---}
\label{sec:org4a67ddd}

\subsection{Started:  Thu Dec 11 15:51:26 2025}
\label{sec:org80274fd}
\section{Package Setup}
\label{sec:org655a990}
\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:orgb79b086,numbers=none]
;;;; Day08.lisp
;;;; 2025 AOC Day 8 solution
;;;; Common Lisp solutions by Leo Laporte (with lots of help)
;;;; Started: Thu Dec 11 15:51:26 2025
;;;; Finished: Fri 19 Dec 2025 08:55:40 PM PST

(defpackage :aoc.2025.day08
  (:use :cl :alexandria :iterate)      ; no prefix for these libraries
  (:local-nicknames                    ; short prefixes for these
   (:re :cl-ppcre)                     ; regex
   (:5a :fiveam)                       ; test framework
   (:sr :serapeum)                     ; CL extensions
   (:tr :trivia)))                     ; pattern matching

(in-package :aoc.2025.day08)

(setf 5a:*run-test-when-defined* t)  ; test as we go
(setf 5a:*verbose-failures* t)       ; show failing expression
(sr:toggle-pretty-print-hash-table)  ; automatic pretty print for hashes
(declaim (optimize (debug 3)))       ; max debugging info
;; (declaim (optimize (speed 3))     ; max speed if needed

(defparameter *data-file* "~/cl/AOC/2025/Day08/input.txt"
  "Downloaded from the AoC problem set")
\end{lstlisting}
\section{Part One}
\label{sec:orgcdbef88}

\subsection{Notes for Part One}
\label{sec:orgf599401}

These numbers represent ``junction boxes'' with X Y Z coordinates in a 3D
space. We (well the elves) want to connect the junction boxes that are closest
together in a straight line (i.e. Euclidean distance). So

$$d(p,q)=\sqrt{(p_{1}-q_{1})^{2}+(p_{2}-q_{2})^{2}+(p_{3}-q_{3})^{2}}$$

Or in Lisp: (dist p q) = (sqrt (+ (expt (- xp xq) 2)  (expt (- yp yq) 2)  (expt (- zp zq) 2)

Once we connect the two closest junction boxes to form a circuit, we look for
the next two. If any are already in a circuit the new junction points are added
to that circuit. And continue until we've connected all the points up to the
limit (10 for the example, 1000 for the input).

Then multiply the largest 3 circuits (by the number of junction boxes in the
circuit) to get the answer. In the example it's (5x4x2) or 40.

The problem asks us to ``connect together the 1000 pairs of junction boxes which
are closest together. Afterward, what do you get if you multiply together the
sizes of the three largest circuits?''
