2025/Day08/Day08.org
** Example Data

#+begin_src lisp :results silent
(defparameter *example* (list "162,817,812"
                              "57,618,57"
                              "906,360,560"
                              "592,479,940"
                               "352,342,300"
                              "466,668,158"
                              "542,29,236"
                              "431,825,988"
                              "739,650,466"
                              "52,470,668"
                              "216,146,977"
                              "819,987,18"
                              "117,168,530"
                              "805,96,715"
                              "346,949,466"
                              "970,615,88"
                              "941,993,340"
                              "862,61,35"
                              "984,92,344"
                              "425,690,689"))

(defparameter *example2* (list "1,1,2"
                               "2,14,4"
                               "2,5,6"
                               "3,4,11"
                               "5,8,10"
                               "1,2,7"
                               "12,4,12"
                               "5,2,9"
                               "3,8,11"
                               "16,2,9"
                               "13,4,15"
                               "5,16,7"
                               "18,9,10"
                               "100,100,100")
  "Another perverse example from the fertile mind of Paul Holder Part 1 is the three circuit sizes 7, 2, 2 so the answer is 28, and part 2 is 18, 100 so the answer is 1800")
#+end_src

As usual, the first task is to think about how to represent the data. I think
I'll make a junction box struct with x y and z. Nothing in this first part seems
to want CLOS so I don't need to use defclass but I'll keep that in mind for
part 2. I use short conc-names (j-x j-y and j-z for conciseness). I'm also using
an abbreviated make function name: make-junc.

** defstruct junction

#+name: struct-junction
#+begin_src lisp :results replace
(defstruct (junction
            (:conc-name j-)             ; short name is j-x, j-y. j-z
            (:constructor make-junc (x y z)))
  (x 0 :type integer)
  (y 0 :type integer)
  (z 0 :type integer))

(format t "Print representation: ~a~%"(make-junc 1 2 3))
#+end_src

#+RESULTS: struct-junction
: Print representation: #S(JUNCTION :X 1 :Y 2 :Z 3)

