2025/Day08/Day08.html
<div id="outline-container-org15b746b" class="outline-3">
<h3 id="org15b746b"><span class="section-number-3">3.2.</span> Example Data</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-lisp"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defparameter</span> <span style="color: #79a8ff;">*example*</span> <span style="color: #6c6;">(</span>list <span style="color: #00c06f;">"162,817,812"</span>
                              <span style="color: #00c06f;">"57,618,57"</span>
                              <span style="color: #00c06f;">"906,360,560"</span>
                              <span style="color: #00c06f;">"592,479,940"</span>
                               <span style="color: #00c06f;">"352,342,300"</span>
                              <span style="color: #00c06f;">"466,668,158"</span>
                              <span style="color: #00c06f;">"542,29,236"</span>
                              <span style="color: #00c06f;">"431,825,988"</span>
                              <span style="color: #00c06f;">"739,650,466"</span>
                              <span style="color: #00c06f;">"52,470,668"</span>
                              <span style="color: #00c06f;">"216,146,977"</span>
                              <span style="color: #00c06f;">"819,987,18"</span>
                              <span style="color: #00c06f;">"117,168,530"</span>
                              <span style="color: #00c06f;">"805,96,715"</span>
                              <span style="color: #00c06f;">"346,949,466"</span>
                              <span style="color: #00c06f;">"970,615,88"</span>
                              <span style="color: #00c06f;">"941,993,340"</span>
                              <span style="color: #00c06f;">"862,61,35"</span>
                              <span style="color: #00c06f;">"984,92,344"</span>
                              <span style="color: #00c06f;">"425,690,689"</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defparameter</span> <span style="color: #79a8ff;">*example2*</span> <span style="color: #6c6;">(</span>list <span style="color: #00c06f;">"1,1,2"</span>
                               <span style="color: #00c06f;">"2,14,4"</span>
                               <span style="color: #00c06f;">"2,5,6"</span>
                               <span style="color: #00c06f;">"3,4,11"</span>
                               <span style="color: #00c06f;">"5,8,10"</span>
                               <span style="color: #00c06f;">"1,2,7"</span>
                               <span style="color: #00c06f;">"12,4,12"</span>
                               <span style="color: #00c06f;">"5,2,9"</span>
                               <span style="color: #00c06f;">"3,8,11"</span>
                               <span style="color: #00c06f;">"16,2,9"</span>
                               <span style="color: #00c06f;">"13,4,15"</span>
                               <span style="color: #00c06f;">"5,16,7"</span>
                               <span style="color: #00c06f;">"18,9,10"</span>
                               <span style="color: #00c06f;">"100,100,100"</span><span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Another perverse example from the fertile mind of Paul Holder Part 1 is the three circuit sizes 7, 2, 2 so the answer is 28, and part 2 is 18, 100 so the answer is 1800"</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<p>
As usual, the first task is to think about how to represent the data. I think
I&rsquo;ll make a junction box struct with x y and z. Nothing in this first part seems
to want CLOS so I don&rsquo;t need to use defclass but I&rsquo;ll keep that in mind for
part 2. I use short conc-names (j-x j-y and j-z for conciseness). I&rsquo;m also using
an abbreviated make function name: make-junc.
</p>
</div>
</div>
<div id="outline-container-orge81e4fb" class="outline-3">
<h3 id="orge81e4fb"><span class="section-number-3">3.3.</span> defstruct junction</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-lisp" id="orgc5b7000"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defstruct</span> <span style="color: #6c6;">(</span><span style="color: #b6a0ff; font-weight: bold;">junction</span>
            <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:conc-name</span> j-<span style="color: #69f;">)</span>             <span style="color: #d0a070; font-style: italic;">; short name is j-x, j-y. j-z
</span>            <span style="color: #69f;">(</span><span style="color: #feacd0; font-weight: bold;">:constructor</span> make-junc <span style="color: #cc6;">(</span>x y z<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span>x 0 <span style="color: #feacd0; font-weight: bold;">:type</span> integer<span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span>y 0 <span style="color: #feacd0; font-weight: bold;">:type</span> integer<span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span>z 0 <span style="color: #feacd0; font-weight: bold;">:type</span> integer<span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span>format t <span style="color: #00c06f;">"Print representation: ~a~%"</span><span style="color: #6c6;">(</span>make-junc 1 2 3<span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">
Print representation: #S(JUNCTION :X 1 :Y 2 :Z 3)
</pre>
</div>
</div>
