2025/Day08/Day08.html
<div id="outline-container-org7ddfd59" class="outline-3">
<h3 id="org7ddfd59"><span class="section-number-3">3.4.</span> parse-input()</h3>
<div class="outline-text-3" id="text-3-4">
<p>
And now let&rsquo;s turn the provided list of strings into a list(?). If it&rsquo;s a list I
can represent circuits as lists within the list. Never mind. Let&rsquo;s make it a
vector for speed. The sorting will occur later, to the distances, anyway..
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org6df0ab1"><code><span style="color: #c66;">(</span>sr:-&gt; parse-input <span style="color: #6c6;">(</span>list<span style="color: #6c6;">)</span> vector<span style="color: #c66;">)</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">parse-input</span> <span style="color: #6c6;">(</span>input<span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> box in input<span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>collect
        <span style="color: #cc6;">(</span>apply #'make-junc <span style="color: #6cc;">(</span>mapcar #'parse-integer <span style="color: #c6c;">(</span>sr:words box<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
      result-type vector<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span>format t <span style="color: #00c06f;">"~%~a"</span> <span style="color: #6c6;">(</span>parse-input *example*<span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example" id="orgb337bc7">

#(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 57 :Y 618 :Z 57)
  #S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 592 :Y 479 :Z 940)
  #S(JUNCTION :X 352 :Y 342 :Z 300) #S(JUNCTION :X 466 :Y 668 :Z 158)
  #S(JUNCTION :X 542 :Y 29 :Z 236) #S(JUNCTION :X 431 :Y 825 :Z 988)
  #S(JUNCTION :X 739 :Y 650 :Z 466) #S(JUNCTION :X 52 :Y 470 :Z 668)
  #S(JUNCTION :X 216 :Y 146 :Z 977) #S(JUNCTION :X 819 :Y 987 :Z 18)
  #S(JUNCTION :X 117 :Y 168 :Z 530) #S(JUNCTION :X 805 :Y 96 :Z 715)
  #S(JUNCTION :X 346 :Y 949 :Z 466) #S(JUNCTION :X 970 :Y 615 :Z 88)
  #S(JUNCTION :X 941 :Y 993 :Z 340) #S(JUNCTION :X 862 :Y 61 :Z 35)
  #S(JUNCTION :X 984 :Y 92 :Z 344) #S(JUNCTION :X 425 :Y 690 :Z 689))
</pre>
</div>
</div>
<div id="outline-container-org3696d55" class="outline-3">
<h3 id="org3696d55"><span class="section-number-3">3.5.</span> dist()</h3>
<div class="outline-text-3" id="text-3-5">
<p>
So the next thing I need to do is write a Euclidean distance function. Except
the last part of the Euclidean formula, the square root, adds considerable
calculation time. Using ISQRT - integer square root - is fast, if offering lower resolution.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org7de5ad4"><code><span style="color: #c66;">(</span>sr:-&gt; dist <span style="color: #6c6;">(</span>junction junction<span style="color: #6c6;">)</span> fixnum<span style="color: #c66;">)</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">dist</span> <span style="color: #6c6;">(</span>j1 j2<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"given two JUNCTIONS j1 and j2 return the euclidean distance rounded to the nearest integer between the two"</span>
  <span style="color: #6c6;">(</span>isqrt <span style="color: #69f;">(</span>+ <span style="color: #cc6;">(</span>expt <span style="color: #6cc;">(</span>- <span style="color: #c6c;">(</span>j-x j1<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>j-x j2<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span> 2<span style="color: #cc6;">)</span>
            <span style="color: #cc6;">(</span>expt <span style="color: #6cc;">(</span>- <span style="color: #c6c;">(</span>j-y j1<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>j-y j2<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span> 2<span style="color: #cc6;">)</span>
            <span style="color: #cc6;">(</span>expt <span style="color: #6cc;">(</span>- <span style="color: #c6c;">(</span>j-z j1<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>j-z j2<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span> 2<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span>5a:test dist-test
  <span style="color: #6c6;">(</span>5a:is <span style="color: #69f;">(</span>= <span style="color: #cc6;">(</span>dist <span style="color: #6cc;">(</span>make-junc 1 2 3<span style="color: #6cc;">)</span> <span style="color: #6cc;">(</span>make-junc 4 5 6<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span> 5<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">

Running test DIST-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
