2025/Day08/Day08.tex
\subsection{parse-input()}
\label{sec:orgd3e70d1}

And now let's turn the provided list of strings into a list(?). If it's a list I
can represent circuits as lists within the list. Never mind. Let's make it a
vector for speed. The sorting will occur later, to the distances, anyway..

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org4c7d7ea,numbers=none]
(sr:-> parse-input (list) vector)
(defun parse-input (input)
  (iter (for box in input)
    (collect
        (apply #'make-junc (mapcar #'parse-integer (sr:words box)))
      result-type vector)))

(format t "~%~a" (parse-input *example*))
\end{lstlisting}

\phantomsection
\label{org76711cd}
\begin{verbatim}

#(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 57 :Y 618 :Z 57)
  #S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 592 :Y 479 :Z 940)
  #S(JUNCTION :X 352 :Y 342 :Z 300) #S(JUNCTION :X 466 :Y 668 :Z 158)
  #S(JUNCTION :X 542 :Y 29 :Z 236) #S(JUNCTION :X 431 :Y 825 :Z 988)
  #S(JUNCTION :X 739 :Y 650 :Z 466) #S(JUNCTION :X 52 :Y 470 :Z 668)
  #S(JUNCTION :X 216 :Y 146 :Z 977) #S(JUNCTION :X 819 :Y 987 :Z 18)
  #S(JUNCTION :X 117 :Y 168 :Z 530) #S(JUNCTION :X 805 :Y 96 :Z 715)
  #S(JUNCTION :X 346 :Y 949 :Z 466) #S(JUNCTION :X 970 :Y 615 :Z 88)
  #S(JUNCTION :X 941 :Y 993 :Z 340) #S(JUNCTION :X 862 :Y 61 :Z 35)
  #S(JUNCTION :X 984 :Y 92 :Z 344) #S(JUNCTION :X 425 :Y 690 :Z 689))
\end{verbatim}
\subsection{dist()}
\label{sec:orgd882b6d}

So the next thing I need to do is write a Euclidean distance function. Except
the last part of the Euclidean formula, the square root, adds considerable
calculation time. Using ISQRT - integer square root - is fast, if offering lower resolution.

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org632793a,numbers=none]
(sr:-> dist (junction junction) fixnum)
(defun dist (j1 j2)
  "given two JUNCTIONS j1 and j2 return the euclidean distance rounded to the nearest integer between the two"
  (isqrt (+ (expt (- (j-x j1) (j-x j2)) 2)
            (expt (- (j-y j1) (j-y j2)) 2)
            (expt (- (j-z j1) (j-z j2)) 2))))

(5a:test dist-test
  (5a:is (= (dist (make-junc 1 2 3) (make-junc 4 5 6)) 5)))
\end{lstlisting}

\phantomsection
\label{orgcd81549}
\begin{verbatim}

Running test DIST-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
\end{verbatim}
