2025/Day08/Day08.org
** get-dists()

Now I need to think about how I'll keep track of circuits. I'll worry about the
circuit connections in a bit. My biggest concern is whether I have to calculate
the distances between all points. That's a million calculations for the 1000
junction boxes in the input so I'll use a design pattern I see a lot: a loop
that matches the first element in the list with the succeeding elements, then he
next with the rest and so on. This eliminates two cases we don't care about, the
identity case (dist j1 j1) and the mirror case (dist j1 j2) (dist j2 j1).

I'll make a hash-table of the results - the key will be the distance, the value will be the two junction boxes that make that distance. This will make it easy to create a sorted list of junction box pair distances in the next step.

#+name: get-dists
 #+begin_src lisp :results silent
(sr:-> get-dists (vector) hash-table)
(defun get-dists (junctions)
  "given a vector of JUNCTION structs, return a hash-table of the distances
 between any two pairs of junctions. The key will be the distance, the value the
 pair of junctions that are that far apart"
  (let* ((len (length junctions))
         (distances (make-hash-table :size len)))

    (iter (for i below len)
      (for j1 = (aref junctions i))
      (iter (for j from (1+ i) below len)
        (for j2 = (aref junctions j))

        (let ((d (dist j1 j2)))
          (setf (gethash d distances)
                (append (list j1 j2)
                        (gethash d distances))))))

    distances))
#+end_src

I better profile this to make sure it doesn't take too long. It's a lot of points!

#+name: get-dists-test
#+begin_src lisp :results replace
(let ((*trace-output* *standard-output*))
  (time (get-dists (parse-input (uiop:read-file-lines *data-file*)))))
#+end_src

#+RESULTS: get-dists-test
: Evaluation took:
:   0.104 seconds of real time
:   0.105480 seconds of total run time (0.091414 user, 0.014066 system)
:   [ Run times consist of 0.048 seconds GC time, and 0.058 seconds non-GC time. ]
:   100.96% CPU
:   348,212,123 processor cycles
:   42,131,648 bytes consed
:

Now I can sort the hash-table keys (the distances) to get the shortest distances.

This is what the 10 closest pairs of junction boxes look like...

#+name: 10-junctions
#+begin_src lisp :results replace
(let* ((junctions (parse-input *example*))
       (distances (get-dists junctions))
       (keys (sort (hash-table-keys distances) #'<)))
  (iter (for i below 10)
    (format t "~&~a -> ~a" (gethash (nth i keys) distances) (nth i keys))))
#+end_src

#+RESULTS: 10-junctions
#+begin_example
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 316
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 431 :Y 825 :Z 988)) -> 321
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 805 :Y 96 :Z 715)) -> 322
(#S(JUNCTION :X 431 :Y 825 :Z 988) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 328
(#S(JUNCTION :X 862 :Y 61 :Z 35) #S(JUNCTION :X 984 :Y 92 :Z 344)) -> 333
(#S(JUNCTION :X 52 :Y 470 :Z 668) #S(JUNCTION :X 117 :Y 168 :Z 530)) -> 338
(#S(JUNCTION :X 819 :Y 987 :Z 18) #S(JUNCTION :X 941 :Y 993 :Z 340)) -> 344
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 739 :Y 650 :Z 466)) -> 347
(#S(JUNCTION :X 346 :Y 949 :Z 466) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 350
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 984 :Y 92 :Z 344)) -> 352
#+end_example

