2025/Day08/Day08.html
<div id="outline-container-orgb5d87d5" class="outline-3">
<h3 id="orgb5d87d5"><span class="section-number-3">3.6.</span> get-dists()</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Now I need to think about how I&rsquo;ll keep track of circuits. I&rsquo;ll worry about the
circuit connections in a bit. My biggest concern is whether I have to calculate
the distances between all points. That&rsquo;s a million calculations for the 1000
junction boxes in the input so I&rsquo;ll use a design pattern I see a lot: a loop
that matches the first element in the list with the succeeding elements, then he
next with the rest and so on. This eliminates two cases we don&rsquo;t care about, the
identity case (dist j1 j1) and the mirror case (dist j1 j2) (dist j2 j1).
</p>

<p>
I&rsquo;ll make a hash-table of the results - the key will be the distance, the value will be the two junction boxes that make that distance. This will make it easy to create a sorted list of junction box pair distances in the next step.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org4ccb8a2"><code><span style="color: #c66;">(</span>sr:-&gt; get-dists <span style="color: #6c6;">(</span>vector<span style="color: #6c6;">)</span> hash-table<span style="color: #c66;">)</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">get-dists</span> <span style="color: #6c6;">(</span>junctions<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"given a vector of JUNCTION structs, return a hash-table of the distances
 between any two pairs of junctions. The key will be the distance, the value the
 pair of junctions that are that far apart"</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>len <span style="color: #6cc;">(</span>length junctions<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>distances <span style="color: #6cc;">(</span>make-hash-table <span style="color: #feacd0; font-weight: bold;">:size</span> len<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>

    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> i below len<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j1 = <span style="color: #6cc;">(</span>aref junctions i<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #6cc;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j from <span style="color: #c6c;">(</span>1+ i<span style="color: #c6c;">)</span> below len<span style="color: #6cc;">)</span>
        <span style="color: #6cc;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j2 = <span style="color: #c6c;">(</span>aref junctions j<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>

        <span style="color: #6cc;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #c6c;">(</span><span style="color: #ccc;">(</span>d <span style="color: #999;">(</span>dist j1 j2<span style="color: #999;">)</span><span style="color: #ccc;">)</span><span style="color: #c6c;">)</span>
          <span style="color: #c6c;">(</span>setf <span style="color: #ccc;">(</span>gethash d distances<span style="color: #ccc;">)</span>
                <span style="color: #ccc;">(</span>append <span style="color: #999;">(</span>list j1 j2<span style="color: #999;">)</span>
                        <span style="color: #999;">(</span>gethash d distances<span style="color: #999;">)</span><span style="color: #ccc;">)</span><span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>

    distances<span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<p>
I better profile this to make sure it doesn&rsquo;t take too long. It&rsquo;s a lot of points!
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb9fa031"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #6c6;">(</span><span style="color: #69f;">(</span>*trace-output* *standard-output*<span style="color: #69f;">)</span><span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span>time <span style="color: #69f;">(</span>get-dists <span style="color: #cc6;">(</span>parse-input <span style="color: #6cc;">(</span>uiop:read-file-lines *data-file*<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">
Evaluation took:
  0.084 seconds of real time
  0.084937 seconds of total run time (0.084937 user, 0.000000 system)
  [ Run times consist of 0.040 seconds GC time, and 0.045 seconds non-GC time. ]
  101.19% CPU
  278,882,776 processor cycles
  42,145,392 bytes consed
  
</pre>

<p>
Now I can sort the hash-table keys (the distances) to get the shortest distances.
</p>

<p>
This is what the 10 closest pairs of junction boxes look like&hellip;
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org5a555a9"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #6c6;">(</span><span style="color: #69f;">(</span>junctions <span style="color: #cc6;">(</span>parse-input *example*<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
       <span style="color: #69f;">(</span>distances <span style="color: #cc6;">(</span>get-dists junctions<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
       <span style="color: #69f;">(</span>keys <span style="color: #cc6;">(</span>sort <span style="color: #6cc;">(</span>hash-table-keys distances<span style="color: #6cc;">)</span> #'&lt;<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> i below 10<span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>format t <span style="color: #00c06f;">"~&amp;~a -&gt; ~a"</span> <span style="color: #cc6;">(</span>gethash <span style="color: #6cc;">(</span>nth i keys<span style="color: #6cc;">)</span> distances<span style="color: #cc6;">)</span> <span style="color: #cc6;">(</span>nth i keys<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example" id="orgf56f84e">
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 425 :Y 690 :Z 689)) -&gt; 316
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 431 :Y 825 :Z 988)) -&gt; 321
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 805 :Y 96 :Z 715)) -&gt; 322
(#S(JUNCTION :X 431 :Y 825 :Z 988) #S(JUNCTION :X 425 :Y 690 :Z 689)) -&gt; 328
(#S(JUNCTION :X 862 :Y 61 :Z 35) #S(JUNCTION :X 984 :Y 92 :Z 344)) -&gt; 333
(#S(JUNCTION :X 52 :Y 470 :Z 668) #S(JUNCTION :X 117 :Y 168 :Z 530)) -&gt; 338
(#S(JUNCTION :X 819 :Y 987 :Z 18) #S(JUNCTION :X 941 :Y 993 :Z 340)) -&gt; 344
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 739 :Y 650 :Z 466)) -&gt; 347
(#S(JUNCTION :X 346 :Y 949 :Z 466) #S(JUNCTION :X 425 :Y 690 :Z 689)) -&gt; 350
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 984 :Y 92 :Z 344)) -&gt; 352
</pre>
</div>
</div>
