2025/Day08/Day08.tex
\subsection{get-dists()}
\label{sec:orgdbf751b}

Now I need to think about how I'll keep track of circuits. I'll worry about the
circuit connections in a bit. My biggest concern is whether I have to calculate
the distances between all points. That's a million calculations for the 1000
junction boxes in the input so I'll use a design pattern I see a lot: a loop
that matches the first element in the list with the succeeding elements, then he
next with the rest and so on. This eliminates two cases we don't care about, the
identity case (dist j1 j1) and the mirror case (dist j1 j2) (dist j2 j1).

I'll make a hash-table of the results - the key will be the distance, the value will be the two junction boxes that make that distance. This will make it easy to create a sorted list of junction box pair distances in the next step.

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:orga520bbc,numbers=none]
(sr:-> get-dists (vector) hash-table)
(defun get-dists (junctions)
  "given a vector of JUNCTION structs, return a hash-table of the distances
 between any two pairs of junctions. The key will be the distance, the value the
 pair of junctions that are that far apart"
  (let* ((len (length junctions))
         (distances (make-hash-table :size len)))

    (iter (for i below len)
      (for j1 = (aref junctions i))
      (iter (for j from (1+ i) below len)
        (for j2 = (aref junctions j))

        (let ((d (dist j1 j2)))
          (setf (gethash d distances)
                (append (list j1 j2)
                        (gethash d distances))))))

    distances))
\end{lstlisting}

I better profile this to make sure it doesn't take too long. It's a lot of points!

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:orgbeae224,numbers=none]
(let ((*trace-output* *standard-output*))
  (time (get-dists (parse-input (uiop:read-file-lines *data-file*)))))
\end{lstlisting}

\phantomsection
\label{org93a5786}
\begin{verbatim}
Evaluation took:
  0.064 seconds of real time
  0.064680 seconds of total run time (0.062707 user, 0.001973 system)
  [ Run times consist of 0.012 seconds GC time, and 0.053 seconds non-GC time. ]
  101.56% CPU
  213,143,951 processor cycles
  42,127,504 bytes consed
  
\end{verbatim}

Now I can sort the hash-table keys (the distances) to get the shortest distances.

This is what the 10 closest pairs of junction boxes look like\ldots{}

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org09ebb6e,numbers=none]
(let* ((junctions (parse-input *example*))
       (distances (get-dists junctions))
       (keys (sort (hash-table-keys distances) #'<)))
  (iter (for i below 10)
    (format t "~&~a -> ~a" (gethash (nth i keys) distances) (nth i keys))))
\end{lstlisting}

\phantomsection
\label{orgf8a2d51}
\begin{verbatim}
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 316
(#S(JUNCTION :X 162 :Y 817 :Z 812) #S(JUNCTION :X 431 :Y 825 :Z 988)) -> 321
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 805 :Y 96 :Z 715)) -> 322
(#S(JUNCTION :X 431 :Y 825 :Z 988) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 328
(#S(JUNCTION :X 862 :Y 61 :Z 35) #S(JUNCTION :X 984 :Y 92 :Z 344)) -> 333
(#S(JUNCTION :X 52 :Y 470 :Z 668) #S(JUNCTION :X 117 :Y 168 :Z 530)) -> 338
(#S(JUNCTION :X 819 :Y 987 :Z 18) #S(JUNCTION :X 941 :Y 993 :Z 340)) -> 344
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 739 :Y 650 :Z 466)) -> 347
(#S(JUNCTION :X 346 :Y 949 :Z 466) #S(JUNCTION :X 425 :Y 690 :Z 689)) -> 350
(#S(JUNCTION :X 906 :Y 360 :Z 560) #S(JUNCTION :X 984 :Y 92 :Z 344)) -> 352
\end{verbatim}
