2025/Day08/Day08.org
** sort-pairs-by-distance()

I'm going to do this a lot, so let's make a function that takes the input and
returns a list of junction box pairs sorted ascending by distance. This is
really an extension of the parse function. I could put this in PARSE-INPUT but
I'll factor it out for clarity.

#+name: sort-pairs-by-distance
#+begin_src lisp :results silent
(sr:-> sort-pairs-by-distance (list) list)
(defun sort-pairs-by-distance (input)
  "given a list of strings representing a list of JUNCTIONS, return a list of
 JUNCTION pairs sorted ascending by the distance between the pair"
  (let* ((distances (get-dists (parse-input input))) ; hash of dists->juncs
         (keys (sort (hash-table-keys distances) #'<))) ; list of sorted dists

    (iter (for k in keys)
      (collect (gethash k distances)))))
#+end_src

And just to reassure me that this doesn't take too long with the full problem set

#+name: sort-pairs-by-distance-profile
#+begin_src lisp :results replace
(let ((*trace-output* *standard-output*))
  (time (sort-pairs-by-distance (uiop:read-file-lines *data-file*))))
#+end_src

#+RESULTS: sort-pairs-by-distance-profile
: Evaluation took:
:   0.115 seconds of real time
:   0.115654 seconds of total run time (0.115654 user, 0.000000 system)
:   [ Run times consist of 0.043 seconds GC time, and 0.073 seconds non-GC time. ]
:   100.87% CPU
:   380,363,503 processor cycles
:   45,642,784 bytes consed
:

OK fast enough. But does it work? Let's compare the four closest junction boxes to the example provided in AoC:

#+name: sort-pairs-by-distance-test
#+begin_src lisp :results replace

(5a:test sort-pairs-by-distance-test
  (let ((closest (subseq (sort-pairs-by-distance *example*) 0 4)))
    (5a:is (equalp (first closest)
                   (list (make-junc 162 817 812) (make-junc 425 690 689))))
    (5a:is (equalp (second closest)
                   (list (make-junc 162 817 812) (make-junc 431 825 988))))
    (5a:is (equalp (third closest)
                   (list (make-junc 906 360 560) (make-junc 805 96 715))))
    (5a:is (equalp (fourth closest)
                   (list (make-junc 431 825 988) (make-junc 425 690 689))))))
#+end_src

#+RESULTS: sort-pairs-by-distance-test
:
: Running test SORT-PAIRS-BY-DISTANCE-TEST ....
:  Did 4 checks.
:     Pass: 4 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)

