2025/Day08/Day08.html
<div id="outline-container-orge2d5b4e" class="outline-3">
<h3 id="orge2d5b4e"><span class="section-number-3">3.7.</span> sort-pairs-by-distance()</h3>
<div class="outline-text-3" id="text-3-7">
<p>
I&rsquo;m going to do this a lot, so let&rsquo;s make a function that takes the input and
returns a list of junction box pairs sorted ascending by distance. This is
really an extension of the parse function. I could put this in PARSE-INPUT but
I&rsquo;ll factor it out for clarity.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org145ed82"><code><span style="color: #c66;">(</span>sr:-&gt; sort-pairs-by-distance <span style="color: #6c6;">(</span>list<span style="color: #6c6;">)</span> list<span style="color: #c66;">)</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">sort-pairs-by-distance</span> <span style="color: #6c6;">(</span>input<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"given a list of strings representing a list of JUNCTIONS, return a list of
 JUNCTION pairs sorted ascending by the distance between the pair"</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>distances <span style="color: #6cc;">(</span>get-dists <span style="color: #c6c;">(</span>parse-input input<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span> <span style="color: #d0a070; font-style: italic;">; hash of dists-&gt;juncs
</span>         <span style="color: #cc6;">(</span>keys <span style="color: #6cc;">(</span>sort <span style="color: #c6c;">(</span>hash-table-keys distances<span style="color: #c6c;">)</span> #'&lt;<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span> <span style="color: #d0a070; font-style: italic;">; list of sorted dists
</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> k in keys<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>collect <span style="color: #6cc;">(</span>gethash k distances<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<p>
And just to reassure me that this doesn&rsquo;t take too long with the full problem set
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org717bb54"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #6c6;">(</span><span style="color: #69f;">(</span>*trace-output* *standard-output*<span style="color: #69f;">)</span><span style="color: #6c6;">)</span>
  <span style="color: #6c6;">(</span>time <span style="color: #69f;">(</span>sort-pairs-by-distance <span style="color: #cc6;">(</span>uiop:read-file-lines *data-file*<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">
Evaluation took:
  0.098 seconds of real time
  0.098677 seconds of total run time (0.085666 user, 0.013011 system)
  [ Run times consist of 0.036 seconds GC time, and 0.063 seconds non-GC time. ]
  101.02% CPU
  325,623,968 processor cycles
  45,632,752 bytes consed
  
</pre>

<p>
OK fast enough. But does it work? Let&rsquo;s compare the four closest junction boxes to the example provided in AoC:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgdfa6636"><code>
<span style="color: #c66;">(</span>5a:test sort-pairs-by-distance-test
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>closest <span style="color: #6cc;">(</span>subseq <span style="color: #c6c;">(</span>sort-pairs-by-distance *example*<span style="color: #c6c;">)</span> 0 4<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>equalp <span style="color: #6cc;">(</span>first closest<span style="color: #6cc;">)</span>
                   <span style="color: #6cc;">(</span>list <span style="color: #c6c;">(</span>make-junc 162 817 812<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>make-junc 425 690 689<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>equalp <span style="color: #6cc;">(</span>second closest<span style="color: #6cc;">)</span>
                   <span style="color: #6cc;">(</span>list <span style="color: #c6c;">(</span>make-junc 162 817 812<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>make-junc 431 825 988<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>equalp <span style="color: #6cc;">(</span>third closest<span style="color: #6cc;">)</span>
                   <span style="color: #6cc;">(</span>list <span style="color: #c6c;">(</span>make-junc 906 360 560<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>make-junc 805 96 715<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>equalp <span style="color: #6cc;">(</span>fourth closest<span style="color: #6cc;">)</span>
                   <span style="color: #6cc;">(</span>list <span style="color: #c6c;">(</span>make-junc 431 825 988<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>make-junc 425 690 689<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">

Running test SORT-PAIRS-BY-DISTANCE-TEST ....
 Did 4 checks.
    Pass: 4 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
