2025/Day08/Day08.tex
\subsection{sort-pairs-by-distance()}
\label{sec:org485dcf5}

I'm going to do this a lot, so let's make a function that takes the input and
returns a list of junction box pairs sorted ascending by distance. This is
really an extension of the parse function. I could put this in PARSE-INPUT but
I'll factor it out for clarity.

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:orge4dc0b8,numbers=none]
(sr:-> sort-pairs-by-distance (list) list)
(defun sort-pairs-by-distance (input)
  "given a list of strings representing a list of JUNCTIONS, return a list of
 JUNCTION pairs sorted ascending by the distance between the pair"
  (let* ((distances (get-dists (parse-input input))) ; hash of dists->juncs
         (keys (sort (hash-table-keys distances) #'<))) ; list of sorted dists

    (iter (for k in keys)
      (collect (gethash k distances)))))
\end{lstlisting}

And just to reassure me that this doesn't take too long with the full problem set

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org3467d54,numbers=none]
(let ((*trace-output* *standard-output*))
  (time (sort-pairs-by-distance (uiop:read-file-lines *data-file*))))
\end{lstlisting}

\phantomsection
\label{org5ca7b5f}
\begin{verbatim}
Evaluation took:
  0.117 seconds of real time
  0.117798 seconds of total run time (0.115833 user, 0.001965 system)
  [ Run times consist of 0.057 seconds GC time, and 0.061 seconds non-GC time. ]
  100.85% CPU
  389,100,629 processor cycles
  45,609,296 bytes consed
  
\end{verbatim}

OK fast enough. But does it work? Let's compare the four closest junction boxes to the example provided in AoC:

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org8c00c42,numbers=none]

(5a:test sort-pairs-by-distance-test
  (let ((closest (subseq (sort-pairs-by-distance *example*) 0 4)))
    (5a:is (equalp (first closest)
                   (list (make-junc 162 817 812) (make-junc 425 690 689))))
    (5a:is (equalp (second closest)
                   (list (make-junc 162 817 812) (make-junc 431 825 988))))
    (5a:is (equalp (third closest)
                   (list (make-junc 906 360 560) (make-junc 805 96 715))))
    (5a:is (equalp (fourth closest)
                   (list (make-junc 431 825 988) (make-junc 425 690 689))))))
\end{lstlisting}

\phantomsection
\label{org0afa89c}
\begin{verbatim}

Running test SORT-PAIRS-BY-DISTANCE-TEST ....
 Did 4 checks.
    Pass: 4 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
\end{verbatim}
