2025/Day08/Day08.org
** Pause to study up on trees

I think I have all the pieces I need. Now I can write the function that builds
the paths according to the rules in part 1. But wait - I think I'm building a
"minimum spanning tree" that is, the shortest path from start to end.

OK I didn't know that until I got some hints from Reddit but I'm glad I did. I
went down the tree rabbit hole (to mix metaphors), which is something I've been
wanting to do for some time. There are two things that Lispers agree are
important for solving a wide variety of problems: *recursion* which I've got a
pretty good handle on, and *tree* data structures and the wide variety of ways
they can be used. *This* is why I do AoC. I'm not trying to be the fastest, I know
I'm a duffer programmer. I'm in it for the learnings (and it's a really fun way
to learn). I didn't study computer science in school. These problems provide a
fun way for me to learn algorithms, and, incidentally, Common Lisp, Emacs,
org-mode, and Literate Programming. So...

Excuse me while I read up on these in Steve Skiena's [[https://www.algorist.com/][Algorithm Design Manual]] and
Domkin's [[https://link.springer.com/book/10.1007/978-1-4842-6428-7][Programming Algorithms in Lisp]] - which I've owned for some time. And I
watched some videos on YouTube, in particular MIT's Introduction to Algorithms
course, CS 6.006 [[https://youtu.be/76dhtgZt38A?si=UmrVpmgMlrSoYov2][videos 6 and 7]]. I'll be back in a minute.

** Kruskal's Algorithm to the rescue

Let me paraphrase the instructions. This helps me understand what I need to
do. For part 1 I need to start with the two junction boxes that are closest
together. Put them in a circuit. Check the next closest pair. If the pair shares
a junction box with the first circuit, add it to the circuit, otherwise create a
new circuit. Take the next closest pair. Check to see if any of its points fit
into an existing circuit without creating a loop. (It's a loop if /both/ points in
the junction box pair already exist in the circuit.) Only add a pair to an
existing circuit if exactly /one/ of the two points exists in the circuit. Proceed
until all the junction boxes are in a circuit, even if it's only a circuit of
one. Multiply the sizes of the three largest circuits together to get the
answer.

From now on I'll call a junction box a *node* and the distance between two nodes
an *edge*. The circuit I'll call a *path*. So this is a tree. And a path is
really just a *set* of nodes, so I can add a node to a path using UNION to avoid
multiple points. And I can check if a node is already in a circuit using MEMBER.

This is the fundamental process for the whole problem. It turns out that this
is an example of [[https://en.wikipedia.org/wiki/Kruskal%27s_algorithm][Kruskal's Algorithm]] (or Prim's algorithm which is similar). It
delivers the "minimum spanning tree of an undirected edge weight graph." In
other words, the shortest string of lights that can connect all the junction
boxes.

In this case the weights are the distances between points, and the minimum tree
is the shortest length of Christmas lights. So this describes the problem
exactly.

We already have the first two steps done (from Wikipedia):

*** Create a forest (a set of trees) initially consisting of a separate single-vertex tree for each vertex in the input graph. (DONE)

*** Sort the graph edges by weight. (DONE)

Now...

*** Loop through the edges of the graph, in ascending sorted order by their weight.

**** For each edge:
***** Test whether adding the edge to the current forest would create a cycle.
***** If not, add the edge to the forest, combining two trees into a single tree.

At the termination of the algorithm, the forest forms a minimum spanning forest of the graph. If the graph is connected, the forest has a single component and forms a minimum spanning tree. Ta da!

So I need a function that checks whether adding the next pair to the current
forest would create a cycle and then, if there are shared points in nodes,
returns a new joined circuit.

