2025/Day08/Day08.html
<div id="outline-container-org303d083" class="outline-3">
<h3 id="org303d083"><span class="section-number-3">3.8.</span> Pause to study up on trees</h3>
<div class="outline-text-3" id="text-3-8">
<p>
I think I have all the pieces I need. Now I can write the function that builds
the paths according to the rules in part 1. But wait - I think I&rsquo;m building a
&ldquo;minimum spanning tree&rdquo; that is, the shortest path from start to end.
</p>

<p>
OK I didn&rsquo;t know that until I got some hints from Reddit but I&rsquo;m glad I did. I
went down the tree rabbit hole (to mix metaphors), which is something I&rsquo;ve been
wanting to do for some time. There are two things that Lispers agree are
important for solving a wide variety of problems: <b>recursion</b> which I&rsquo;ve got a
pretty good handle on, and <b>tree</b> data structures and the wide variety of ways
they can be used. <b>This</b> is why I do AoC. I&rsquo;m not trying to be the fastest, I know
I&rsquo;m a duffer programmer. I&rsquo;m in it for the learnings (and it&rsquo;s a really fun way
to learn). I didn&rsquo;t study computer science in school. These problems provide a
fun way for me to learn algorithms, and, incidentally, Common Lisp, Emacs,
org-mode, and Literate Programming. So&hellip;
</p>

<p>
Excuse me while I read up on these in Steve Skiena&rsquo;s <a href="https://www.algorist.com/">Algorithm Design Manual</a> and
Domkin&rsquo;s <a href="https://link.springer.com/book/10.1007/978-1-4842-6428-7">Programming Algorithms in Lisp</a> - which I&rsquo;ve owned for some time. And I
watched some videos on YouTube, in particular MIT&rsquo;s Introduction to Algorithms
course, CS 6.006 <a href="https://youtu.be/76dhtgZt38A?si=UmrVpmgMlrSoYov2">videos 6 and 7</a>. I&rsquo;ll be back in a minute.
</p>
</div>
</div>
<div id="outline-container-orgf5a1f6e" class="outline-3">
<h3 id="orgf5a1f6e"><span class="section-number-3">3.9.</span> Kruskal&rsquo;s Algorithm to the rescue</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Let me paraphrase the instructions. This helps me understand what I need to
do. For part 1 I need to start with the two junction boxes that are closest
together. Put them in a circuit. Check the next closest pair. If the pair shares
a junction box with the first circuit, add it to the circuit, otherwise create a
new circuit. Take the next closest pair. Check to see if any of its points fit
into an existing circuit without creating a loop. (It&rsquo;s a loop if <i>both</i> points in
the junction box pair already exist in the circuit.) Only add a pair to an
existing circuit if exactly <i>one</i> of the two points exists in the circuit. Proceed
until all the junction boxes are in a circuit, even if it&rsquo;s only a circuit of
one. Multiply the sizes of the three largest circuits together to get the
answer.
</p>

<p>
From now on I&rsquo;ll call a junction box a <b>node</b> and the distance between two nodes
an <b>edge</b>. The circuit I&rsquo;ll call a <b>path</b>. So this is a tree. And a path is
really just a <b>set</b> of nodes, so I can add a node to a path using UNION to avoid
multiple points. And I can check if a node is already in a circuit using MEMBER.
</p>

<p>
This is the fundamental process for the whole problem. It turns out that this
is an example of <a href="https://en.wikipedia.org/wiki/Kruskal%27s_algorithm">Kruskal&rsquo;s Algorithm</a> (or Prim&rsquo;s algorithm which is similar). It
delivers the &ldquo;minimum spanning tree of an undirected edge weight graph.&rdquo; In
other words, the shortest string of lights that can connect all the junction
boxes.
</p>

<p>
In this case the weights are the distances between points, and the minimum tree
is the shortest length of Christmas lights. So this describes the problem
exactly.
</p>

<p>
We already have the first two steps done (from Wikipedia):
</p>
</div>
<div id="outline-container-org36949b7" class="outline-4">
<h4 id="org36949b7"><span class="section-number-4">3.9.1.</span> Create a forest (a set of trees) initially consisting of a separate single-vertex tree for each vertex in the input graph. (DONE)</h4>
</div>

<div id="outline-container-org6291f98" class="outline-4">
<h4 id="org6291f98"><span class="section-number-4">3.9.2.</span> Sort the graph edges by weight. (DONE)</h4>
<div class="outline-text-4" id="text-3-9-2">
<p>
Now&hellip;
</p>
</div>
</div>
<div id="outline-container-orgb2d3125" class="outline-4">
<h4 id="orgb2d3125"><span class="section-number-4">3.9.3.</span> Loop through the edges of the graph, in ascending sorted order by their weight.</h4>
<div class="outline-text-4" id="text-3-9-3">
</div>
<ol class="org-ol">
<li><a id="orgbf6aa05"></a>For each edge:<br />
<ol class="org-ol">
<li><a id="org07e8fde"></a>Test whether adding the edge to the current forest would create a cycle.<br /></li>
<li><a id="orged4f832"></a>If not, add the edge to the forest, combining two trees into a single tree.<br />
<div class="outline-text-6" id="text-3-9-3-1-2">
<p>
At the termination of the algorithm, the forest forms a minimum spanning forest of the graph. If the graph is connected, the forest has a single component and forms a minimum spanning tree. Ta da!
</p>

<p>
So I need a function that checks whether adding the next pair to the current
forest would create a cycle and then, if there are shared points in nodes,
returns a new joined circuit.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
