2025/Day08/Day08.html
<div id="outline-container-org9fecde6" class="outline-3">
<h3 id="org9fecde6"><span class="section-number-3">3.10.</span> A Fresh Start with Union-Find</h3>
<div class="outline-text-3" id="text-3-10">
<p>
OK here&rsquo;s where things get interesting. My first attempt at this problem (the
ADD-PAIR-TO-PATH? and BUILD-PATHS functions I wrote earlier, now abandoned)
tried to track circuits using lists and set operations. It worked&hellip; sort of.
But it had a fatal flaw: when I tried to merge two circuits together, I wasn&rsquo;t
doing it correctly. The order of connections mattered, and I was losing track of
which nodes belonged to which circuit.
</p>

<p>
After banging my head against this for a while, I went back to the algorithm
textbooks. It turns out there&rsquo;s a classic data structure designed <i>exactly</i> for
this problem: <b>Union-Find</b> (also called &ldquo;Disjoint Set Union&rdquo; or DSU). It&rsquo;s one of
those beautiful computer science inventions that makes a hard problem easy.
</p>

<p>
The idea is simple: imagine each junction box starts in its own little circuit
(a &ldquo;component&rdquo;). When we connect two junction boxes with a wire, their circuits
merge.  Union-Find lets us do two things very fast:
</p>

<ul class="org-ul">
<li><b>FIND</b>: &ldquo;Which circuit does this junction box belong to?&rdquo; (Find the &ldquo;root&rdquo; or representative of its component)</li>
<li><b>UNION</b>: &ldquo;Merge these two circuits into one.&rdquo; (Connect two components)</li>
</ul>

<p>
The magic is in two optimizations:
</p>

<ol class="org-ol">
<li><b>Path compression</b>: When we look up which circuit a node belongs to, we update
its pointer to go directly to the root. This flattens the tree over time.</li>

<li><b>Union by rank</b>: When merging circuits, we attach the shorter tree under the
taller one, keeping things balanced.</li>
</ol>

<p>
With both optimizations, these operations run in nearly O(1) time - actually
O((n)) where  is the inverse Ackermann function, which is essentially constant
for any practical input size. Pretty neat!
</p>

<p>
I&rsquo;m using hash tables here instead of arrays because my junction boxes are
structs, not simple integers. The <code>:test 'equalp</code> ensures struct equality works.
</p>
</div>
