2025/Day08/Day08.tex
\subsection{A Fresh Start with Union-Find}
\label{sec:orgefd25a0}

OK here's where things get interesting. My first attempt at this problem (the
ADD-PAIR-TO-PATH? and BUILD-PATHS functions I wrote earlier, now abandoned)
tried to track circuits using lists and set operations. It worked\ldots{} sort of.
But it had a fatal flaw: when I tried to merge two circuits together, I wasn't
doing it correctly. The order of connections mattered, and I was losing track of
which nodes belonged to which circuit.

After banging my head against this for a while, I went back to the algorithm
textbooks. It turns out there's a classic data structure designed \emph{exactly} for
this problem: \textbf{Union-Find} (also called ``Disjoint Set Union'' or DSU). It's one of
those beautiful computer science inventions that makes a hard problem easy.

The idea is simple: imagine each junction box starts in its own little circuit
(a ``component''). When we connect two junction boxes with a wire, their circuits
merge.  Union-Find lets us do two things very fast:

\begin{itemize}
\item \textbf{FIND}: ``Which circuit does this junction box belong to?'' (Find the ``root'' or representative of its component)
\item \textbf{UNION}: ``Merge these two circuits into one.'' (Connect two components)
\end{itemize}

The magic is in two optimizations:

\begin{enumerate}
\item \textbf{Path compression}: When we look up which circuit a node belongs to, we update
its pointer to go directly to the root. This flattens the tree over time.

\item \textbf{Union by rank}: When merging circuits, we attach the shorter tree under the
taller one, keeping things balanced.
\end{enumerate}

With both optimizations, these operations run in nearly O(1) time - actually
O(α(n)) where α is the inverse Ackermann function, which is essentially constant
for any practical input size. Pretty neat!

I'm using hash tables here instead of arrays because my junction boxes are
structs, not simple integers. The \texttt{:test 'equalp} ensures struct equality works.
