2025/Day08/Day08.html
<div id="outline-container-org624ef7c" class="outline-4">
<h4 id="org624ef7c"><span class="section-number-4">3.10.1.</span> Union-Find Implementation</h4>
<div class="outline-text-4" id="text-3-10-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org7112009"><code><span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Union-Find data structure using hash tables (for struct keys)
</span><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">make-union-find</span> <span style="color: #6c6;">()</span>
  <span style="color: #bfebe0; font-style: italic;">"Create a new union-find structure. Returns (parent . rank) hash tables."</span>
  <span style="color: #6c6;">(</span>cons <span style="color: #69f;">(</span>make-hash-table <span style="color: #feacd0; font-weight: bold;">:test</span> 'equalp<span style="color: #69f;">)</span>   <span style="color: #d0a070; font-style: italic;">; parent
</span>        <span style="color: #69f;">(</span>make-hash-table <span style="color: #feacd0; font-weight: bold;">:test</span> 'equalp<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span> <span style="color: #d0a070; font-style: italic;">; rank
</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">uf-find</span> <span style="color: #6c6;">(</span>uf node<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Find the root of NODE with path compression."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>parent <span style="color: #6cc;">(</span>car uf<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Initialize node if not seen
</span>    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">unless</span> <span style="color: #cc6;">(</span>gethash node parent<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>setf <span style="color: #6cc;">(</span>gethash node parent<span style="color: #6cc;">)</span> node<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Find root with path compression
</span>    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">if</span> <span style="color: #cc6;">(</span>equalp <span style="color: #6cc;">(</span>gethash node parent<span style="color: #6cc;">)</span> node<span style="color: #cc6;">)</span>
        node
        <span style="color: #cc6;">(</span>setf <span style="color: #6cc;">(</span>gethash node parent<span style="color: #6cc;">)</span>
              <span style="color: #6cc;">(</span>uf-find uf <span style="color: #c6c;">(</span>gethash node parent<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">uf-union</span> <span style="color: #6c6;">(</span>uf node1 node2<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Union the sets containing NODE1 and NODE2. Returns T if they were separate."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>parent <span style="color: #6cc;">(</span>car uf<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>rank <span style="color: #6cc;">(</span>cdr uf<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>root1 <span style="color: #6cc;">(</span>uf-find uf node1<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>root2 <span style="color: #6cc;">(</span>uf-find uf node2<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">unless</span> <span style="color: #cc6;">(</span>gethash root1 rank<span style="color: #cc6;">)</span> <span style="color: #cc6;">(</span>setf <span style="color: #6cc;">(</span>gethash root1 rank<span style="color: #6cc;">)</span> 0<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">unless</span> <span style="color: #cc6;">(</span>gethash root2 rank<span style="color: #cc6;">)</span> <span style="color: #cc6;">(</span>setf <span style="color: #6cc;">(</span>gethash root2 rank<span style="color: #6cc;">)</span> 0<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">cond</span>
      <span style="color: #cc6;">(</span><span style="color: #6cc;">(</span>equalp root1 root2<span style="color: #6cc;">)</span> nil<span style="color: #cc6;">)</span>  <span style="color: #d0a070; font-style: italic;">; already in same set
</span>      <span style="color: #cc6;">(</span><span style="color: #6cc;">(</span>&lt; <span style="color: #c6c;">(</span>gethash root1 rank<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>gethash root2 rank<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>
       <span style="color: #6cc;">(</span>setf <span style="color: #c6c;">(</span>gethash root1 parent<span style="color: #c6c;">)</span> root2<span style="color: #6cc;">)</span>
       t<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #6cc;">(</span>&gt; <span style="color: #c6c;">(</span>gethash root1 rank<span style="color: #c6c;">)</span> <span style="color: #c6c;">(</span>gethash root2 rank<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>
       <span style="color: #6cc;">(</span>setf <span style="color: #c6c;">(</span>gethash root2 parent<span style="color: #c6c;">)</span> root1<span style="color: #6cc;">)</span>
       t<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>t
       <span style="color: #6cc;">(</span>setf <span style="color: #c6c;">(</span>gethash root2 parent<span style="color: #c6c;">)</span> root1<span style="color: #6cc;">)</span>
       <span style="color: #6cc;">(</span>incf <span style="color: #c6c;">(</span>gethash root1 rank<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>
       t<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">uf-component-sizes</span> <span style="color: #6c6;">(</span>uf nodes<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Return a list of component sizes for all NODES in union-find UF."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>size-map <span style="color: #6cc;">(</span>make-hash-table <span style="color: #feacd0; font-weight: bold;">:test</span> 'equalp<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> node in nodes<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #6cc;">(</span><span style="color: #c6c;">(</span>root <span style="color: #ccc;">(</span>uf-find uf node<span style="color: #ccc;">)</span><span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>
        <span style="color: #6cc;">(</span>incf <span style="color: #c6c;">(</span>gethash root size-map 0<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>hash-table-values size-map<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>

<span style="color: #c66;">(</span>5a:test union-find-test
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>uf <span style="color: #6cc;">(</span>make-union-find<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Initially separate
</span>    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>uf-union uf 'a 'b<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>  <span style="color: #d0a070; font-style: italic;">; returns T, now connected
</span>    <span style="color: #69f;">(</span>5a:is-false <span style="color: #cc6;">(</span>uf-union uf 'a 'b<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>  <span style="color: #d0a070; font-style: italic;">; returns NIL, already connected
</span>    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>uf-union uf 'c 'd<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>uf-union uf 'b 'c<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>  <span style="color: #d0a070; font-style: italic;">; connects {a,b} with {c,d}
</span>    <span style="color: #69f;">(</span>5a:is-false <span style="color: #cc6;">(</span>uf-union uf 'a 'd<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>  <span style="color: #d0a070; font-style: italic;">; all in same component now
</span>    <span style="color: #69f;">(</span>5a:is <span style="color: #cc6;">(</span>equal <span style="color: #6cc;">(</span>list 4<span style="color: #6cc;">)</span> <span style="color: #6cc;">(</span>uf-component-sizes uf '<span style="color: #c6c;">(</span>a b c d<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">

Running test UNION-FIND-TEST ......
 Did 6 checks.
    Pass: 6 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
