2025/Day08/Day08.tex
\subsubsection{Union-Find Implementation}
\label{sec:org3791a55}

\begin{lstlisting}[basicstyle=\ttfamily\small,keywordstyle=\color{blue},commentstyle=\color{gray},stringstyle=\color{green!50!black},frame=single,breaklines=true,breakatwhitespace=true,language=Lisp,label=lst:org257c1b5,numbers=none]
;; Union-Find data structure using hash tables (for struct keys)
(defun make-union-find ()
  "Create a new union-find structure. Returns (parent . rank) hash tables."
  (cons (make-hash-table :test 'equalp)   ; parent
        (make-hash-table :test 'equalp))) ; rank

(defun uf-find (uf node)
  "Find the root of NODE with path compression."
  (let ((parent (car uf)))
    ;; Initialize node if not seen
    (unless (gethash node parent)
      (setf (gethash node parent) node))
    ;; Find root with path compression
    (if (equalp (gethash node parent) node)
        node
        (setf (gethash node parent)
              (uf-find uf (gethash node parent))))))

(defun uf-union (uf node1 node2)
  "Union the sets containing NODE1 and NODE2. Returns T if they were separate."
  (let* ((parent (car uf))
         (rank (cdr uf))
         (root1 (uf-find uf node1))
         (root2 (uf-find uf node2)))
    (unless (gethash root1 rank) (setf (gethash root1 rank) 0))
    (unless (gethash root2 rank) (setf (gethash root2 rank) 0))
    (cond
      ((equalp root1 root2) nil)  ; already in same set
      ((< (gethash root1 rank) (gethash root2 rank))
       (setf (gethash root1 parent) root2)
       t)
      ((> (gethash root1 rank) (gethash root2 rank))
       (setf (gethash root2 parent) root1)
       t)
      (t
       (setf (gethash root2 parent) root1)
       (incf (gethash root1 rank))
       t))))

(defun uf-component-sizes (uf nodes)
  "Return a list of component sizes for all NODES in union-find UF."
  (let ((size-map (make-hash-table :test 'equalp)))
    (iter (for node in nodes)
      (let ((root (uf-find uf node)))
        (incf (gethash root size-map 0))))
    (hash-table-values size-map)))

(5a:test union-find-test
  (let ((uf (make-union-find)))
    ;; Initially separate
    (5a:is (uf-union uf 'a 'b))  ; returns T, now connected
    (5a:is-false (uf-union uf 'a 'b))  ; returns NIL, already connected
    (5a:is (uf-union uf 'c 'd))
    (5a:is (uf-union uf 'b 'c))  ; connects {a,b} with {c,d}
    (5a:is-false (uf-union uf 'a 'd))  ; all in same component now
    (5a:is (equal (list 4) (uf-component-sizes uf '(a b c d))))))
\end{lstlisting}

\phantomsection
\label{org18b967f}
\begin{verbatim}

Running test UNION-FIND-TEST ......
 Did 6 checks.
    Pass: 6 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
\end{verbatim}
