2025/Day08/Day08.org
*** get-all-edges()

Now I need to rethink how I'm generating the edges. My earlier GET-DISTS
function stored edges in a hash table keyed by distance, but that's awkward for
Kruskal's algorithm which wants a simple sorted list of edges.

So I'm rewriting this to return a list of =(distance j1 j2)= tuples, sorted by
distance. This is the format Kruskal wants: "give me all the edges from shortest
to longest, and I'll process them in order."

The nested loop pattern is the same as before - for each junction box, I pair it
with every junction box that comes /after/ it in the vector. This avoids both
the identity case (distance from a point to itself) and duplicates (we don't
need both A→B and B→A).

One nice thing about having the distance as the first element of each tuple: I
can sort the whole list with =#'< :key #'first= and it just works.

#+name: get-all-edges
#+begin_src lisp :results silent
(sr:-> get-all-edges (vector) list)
(defun get-all-edges (junctions)
  "Return a list of (distance j1 j2) for all pairs, sorted by distance."
  (let* ((len (length junctions))
         (edges nil))
    (iter (for i below len)
      (for j1 = (aref junctions i))
      (iter (for j from (1+ i) below len)
        (for j2 = (aref junctions j))
        (push (list (dist j1 j2) j1 j2) edges)))
    (sort edges #'< :key #'first)))
#+end_src

*** kruskal()

Now for the main event! This is Kruskal's algorithm, and it's surprisingly
simple once you have Union-Find doing the heavy lifting.

The algorithm works like this:
1. Start with each junction box in its own component (this happens automatically
   when we first call UF-FIND on a node)
2. Process edges in order from shortest to longest
3. For each edge, try to union the two junction boxes
4. If they were already in the same component, UF-UNION returns NIL (we'd create
   a cycle, so skip this edge)
5. If they were in different components, UF-UNION returns T (we just merged
   them!)
6. Stop after processing MAX-EDGES edges

For Part 1, we process exactly 1000 edges (or 10 for the example), then count
how many junction boxes ended up in each component. The answer is the product of
the three largest component sizes.

I'm also tracking the last edge processed, which will be useful for Part 2. And
I keep a list of all nodes we've seen so I can calculate component sizes at the
end.

#+name: kruskal
#+begin_src lisp :results silent
(defun kruskal (edges max-edges)
  "Process up to MAX-EDGES edges using Kruskal's algorithm.
   Returns (component-sizes last-j1 last-j2)."
  (let ((uf (make-union-find))
        (nodes nil)
        (last-j1 nil)
        (last-j2 nil)
        (edges-processed 0))
    (iter (for (dist j1 j2) in edges)
      (while (< edges-processed max-edges))
      ;; Track all nodes we've seen
      (pushnew j1 nodes :test 'equalp)
      (pushnew j2 nodes :test 'equalp)
      ;; Union the nodes
      (uf-union uf j1 j2)
      (setf last-j1 j1 last-j2 j2)
      (incf edges-processed))
    (values (uf-component-sizes uf nodes) last-j1 last-j2)))
#+end_src

