2025/Day08/Day08.html
<div id="outline-container-orgccbf431" class="outline-4">
<h4 id="orgccbf431"><span class="section-number-4">3.10.2.</span> get-all-edges()</h4>
<div class="outline-text-4" id="text-3-10-2">
<p>
Now I need to rethink how I&rsquo;m generating the edges. My earlier GET-DISTS
function stored edges in a hash table keyed by distance, but that&rsquo;s awkward for
Kruskal&rsquo;s algorithm which wants a simple sorted list of edges.
</p>

<p>
So I&rsquo;m rewriting this to return a list of <code>(distance j1 j2)</code> tuples, sorted by
distance. This is the format Kruskal wants: &ldquo;give me all the edges from shortest
to longest, and I&rsquo;ll process them in order.&rdquo;
</p>

<p>
The nested loop pattern is the same as before - for each junction box, I pair it
with every junction box that comes <i>after</i> it in the vector. This avoids both
the identity case (distance from a point to itself) and duplicates (we don&rsquo;t
need both AB and BA).
</p>

<p>
One nice thing about having the distance as the first element of each tuple: I
can sort the whole list with <code>#'&lt; :key #'first</code> and it just works.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org5bc8680"><code><span style="color: #c66;">(</span>sr:-&gt; get-all-edges <span style="color: #6c6;">(</span>vector<span style="color: #6c6;">)</span> list<span style="color: #c66;">)</span>
<span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">get-all-edges</span> <span style="color: #6c6;">(</span>junctions<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Return a list of (distance j1 j2) for all pairs, sorted by distance."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>len <span style="color: #6cc;">(</span>length junctions<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>edges nil<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> i below len<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j1 = <span style="color: #6cc;">(</span>aref junctions i<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #6cc;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j from <span style="color: #c6c;">(</span>1+ i<span style="color: #c6c;">)</span> below len<span style="color: #6cc;">)</span>
        <span style="color: #6cc;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j2 = <span style="color: #c6c;">(</span>aref junctions j<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span>
        <span style="color: #6cc;">(</span>push <span style="color: #c6c;">(</span>list <span style="color: #ccc;">(</span>dist j1 j2<span style="color: #ccc;">)</span> j1 j2<span style="color: #c6c;">)</span> edges<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>sort edges #'&lt; <span style="color: #feacd0; font-weight: bold;">:key</span> #'first<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgef86212" class="outline-4">
<h4 id="orgef86212"><span class="section-number-4">3.10.3.</span> kruskal()</h4>
<div class="outline-text-4" id="text-3-10-3">
<p>
Now for the main event! This is Kruskal&rsquo;s algorithm, and it&rsquo;s surprisingly
simple once you have Union-Find doing the heavy lifting.
</p>

<p>
The algorithm works like this:
</p>
<ol class="org-ol">
<li>Start with each junction box in its own component (this happens automatically
when we first call UF-FIND on a node)</li>
<li>Process edges in order from shortest to longest</li>
<li>For each edge, try to union the two junction boxes</li>
<li>If they were already in the same component, UF-UNION returns NIL (we&rsquo;d create
a cycle, so skip this edge)</li>
<li>If they were in different components, UF-UNION returns T (we just merged
them!)</li>
<li>Stop after processing MAX-EDGES edges</li>
</ol>

<p>
For Part 1, we process exactly 1000 edges (or 10 for the example), then count
how many junction boxes ended up in each component. The answer is the product of
the three largest component sizes.
</p>

<p>
I&rsquo;m also tracking the last edge processed, which will be useful for Part 2. And
I keep a list of all nodes we&rsquo;ve seen so I can calculate component sizes at the
end.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgd0864a6"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">kruskal</span> <span style="color: #6c6;">(</span>edges max-edges<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Process up to MAX-EDGES edges using Kruskal's algorithm.
   Returns (component-sizes last-j1 last-j2)."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>uf <span style="color: #6cc;">(</span>make-union-find<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
        <span style="color: #cc6;">(</span>nodes nil<span style="color: #cc6;">)</span>
        <span style="color: #cc6;">(</span>last-j1 nil<span style="color: #cc6;">)</span>
        <span style="color: #cc6;">(</span>last-j2 nil<span style="color: #cc6;">)</span>
        <span style="color: #cc6;">(</span>edges-processed 0<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> <span style="color: #6cc;">(</span>dist j1 j2<span style="color: #6cc;">)</span> in edges<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">while</span> <span style="color: #6cc;">(</span>&lt; edges-processed max-edges<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
      <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Track all nodes we've seen
</span>      <span style="color: #cc6;">(</span>pushnew j1 nodes <span style="color: #feacd0; font-weight: bold;">:test</span> 'equalp<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>pushnew j2 nodes <span style="color: #feacd0; font-weight: bold;">:test</span> 'equalp<span style="color: #cc6;">)</span>
      <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Union the nodes
</span>      <span style="color: #cc6;">(</span>uf-union uf j1 j2<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>setf last-j1 j1 last-j2 j2<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>incf edges-processed<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>values <span style="color: #cc6;">(</span>uf-component-sizes uf nodes<span style="color: #cc6;">)</span> last-j1 last-j2<span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>
</div>
</div>
