2025/Day08/Day08.org
*** Solution

With all the pieces in place, DAY08-1 becomes almost trivial. Parse the input,
generate all edges sorted by distance, run Kruskal for the specified number of
edges, sort the resulting component sizes in descending order, take the top
three, and multiply them together.

I'm using Serapeum's threading macro =~>= here because I find it reads nicely:
"take sizes, sort descending, take first 3, multiply them." The underscore =_=
is where the result of each step gets plugged into the next.

#+name: day08-1
#+begin_src lisp :results silent
(defun day08-1 (input max-edges)
  "Given a list of junction boxes, INPUT, return the result of multiplying
 together the three largest possible circuits that can be built by connecting
 the MAX-EDGES closest pairs. Uses Kruskal's algorithm with Union-Find."
  (let* ((junctions (parse-input input))
         (edges (get-all-edges junctions))
         (sizes (kruskal edges max-edges)))
    (sr:~> sizes
           (sort _ #'>)
           (subseq _ 0 (min 3 (length _)))
           (apply #'* _))))
#+end_src

*** Test

#+begin_src lisp :results replace
(5a:test day08-1-test
  (5a:is (= 40 (day08-1 *example* 10))))
#+end_src

#+RESULTS:
:
: Running test DAY08-1-TEST .
:  Did 1 check.
:     Pass: 1 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)

*** Part one finished: Sat Dec 13 16:00:55 2025

* Part Two

** Notes

Part 2 threw me for a loop at first. The problem says: find the
pair of junction boxes that, when connected, completes a single circuit
containing /all/ the junction boxes. Then multiply their X coordinates.

My first instinct was wrong. I thought "just keep connecting until everything is
connected and remember the last pair." But my old BUILD-PATHS function was
merging circuits in a haphazard way - it wasn't properly tracking which edge
actually /caused/ the final merge.

Here's the key insight that made it click: we're building a *Minimum Spanning
Tree*. To connect n nodes into a single tree, we need exactly n-1 edges. Each
edge we add (that actually merges two components) reduces our component count by
one. We start with n components (each junction box alone) and we need to get
down to 1 component (everything connected).

So the algorithm is:
1. Start with n components (one per junction box)
2. Process edges shortest-to-longest (same as Part 1)
3. Each time UF-UNION returns T, we successfully merged two components -
   decrement our component counter and remember this edge
4. Stop when components = 1 (everything is connected)
5. The last edge that returned T is our answer!

The beauty of Union-Find is that UF-UNION tells us /exactly/ what we need to
know: did this edge actually connect two separate components (T) or were they
already connected (NIL)?

