2025/Day08/Day08.html
<div id="outline-container-orge93d71c" class="outline-4">
<h4 id="orge93d71c"><span class="section-number-4">3.10.4.</span> Solution</h4>
<div class="outline-text-4" id="text-3-10-4">
<p>
With all the pieces in place, DAY08-1 becomes almost trivial. Parse the input,
generate all edges sorted by distance, run Kruskal for the specified number of
edges, sort the resulting component sizes in descending order, take the top
three, and multiply them together.
</p>

<p>
I&rsquo;m using Serapeum&rsquo;s threading macro <code>~&gt;</code> here because I find it reads nicely:
&ldquo;take sizes, sort descending, take first 3, multiply them.&rdquo; The underscore <code>_</code>
is where the result of each step gets plugged into the next.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgd332d71"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">day08-1</span> <span style="color: #6c6;">(</span>input max-edges<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Given a list of junction boxes, INPUT, return the result of multiplying
 together the three largest possible circuits that can be built by connecting
 the MAX-EDGES closest pairs. Uses Kruskal's algorithm with Union-Find."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>junctions <span style="color: #6cc;">(</span>parse-input input<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>edges <span style="color: #6cc;">(</span>get-all-edges junctions<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>sizes <span style="color: #6cc;">(</span>kruskal edges max-edges<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>
    <span style="color: #69f;">(</span>sr:~&gt; sizes
           <span style="color: #cc6;">(</span>sort _ #'&gt;<span style="color: #cc6;">)</span>
           <span style="color: #cc6;">(</span>subseq _ 0 <span style="color: #6cc;">(</span>min 3 <span style="color: #c6c;">(</span>length _<span style="color: #c6c;">)</span><span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
           <span style="color: #cc6;">(</span>apply #'* _<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org8af8e54" class="outline-4">
<h4 id="org8af8e54"><span class="section-number-4">3.10.5.</span> Test</h4>
<div class="outline-text-4" id="text-3-10-5">
<div class="org-src-container">
<pre class="src src-lisp"><code><span style="color: #c66;">(</span>5a:test day08-1-test
  <span style="color: #6c6;">(</span>5a:is <span style="color: #69f;">(</span>= 40 <span style="color: #cc6;">(</span>day08-1 *example* 10<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">

Running test DAY08-1-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
<div id="outline-container-org1a87d7e" class="outline-4">
<h4 id="org1a87d7e"><span class="section-number-4">3.10.6.</span> Part one finished: Sat Dec 13 16:00:55 2025</h4>
</div>
</div>
</div>
<div id="outline-container-org4969b31" class="outline-2">
<h2 id="org4969b31"><span class="section-number-2">4.</span> Part Two</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge19b607" class="outline-3">
<h3 id="orge19b607"><span class="section-number-3">4.1.</span> Notes</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Part 2 threw me for a loop at first. The problem says: find the
pair of junction boxes that, when connected, completes a single circuit
containing <i>all</i> the junction boxes. Then multiply their X coordinates.
</p>

<p>
My first instinct was wrong. I thought &ldquo;just keep connecting until everything is
connected and remember the last pair.&rdquo; But my old BUILD-PATHS function was
merging circuits in a haphazard way - it wasn&rsquo;t properly tracking which edge
actually <i>caused</i> the final merge.
</p>

<p>
Here&rsquo;s the key insight that made it click: we&rsquo;re building a <b>Minimum Spanning
Tree</b>. To connect n nodes into a single tree, we need exactly n-1 edges. Each
edge we add (that actually merges two components) reduces our component count by
one. We start with n components (each junction box alone) and we need to get
down to 1 component (everything connected).
</p>

<p>
So the algorithm is:
</p>
<ol class="org-ol">
<li>Start with n components (one per junction box)</li>
<li>Process edges shortest-to-longest (same as Part 1)</li>
<li>Each time UF-UNION returns T, we successfully merged two components -
decrement our component counter and remember this edge</li>
<li>Stop when components = 1 (everything is connected)</li>
<li>The last edge that returned T is our answer!</li>
</ol>

<p>
The beauty of Union-Find is that UF-UNION tells us <i>exactly</i> what we need to
know: did this edge actually connect two separate components (T) or were they
already connected (NIL)?
</p>
</div>
</div>
