2025/Day08/Day08.org
** Solution

The code is almost the same as KRUSKAL, but instead of processing a fixed number
of edges, we process until there's only one component left. We track the
component count explicitly and decrement it each time we successfully merge.

#+name: day08-2
#+begin_src lisp :results silent
(defun day08-2 (input)
  "Find the pair that connects all junction boxes into a single circuit.
   Return the product of the X coordinates of that pair."
  (let* ((junctions (parse-input input))
         (edges (get-all-edges junctions))
         (uf (make-union-find))
         (n (length junctions))
         (components n)  ; start with n separate components
         (last-j1 nil)
         (last-j2 nil))

    ;; Initialize all nodes in union-find
    (iter (for j in-vector junctions)
      (uf-find uf j))

    ;; Process edges until we have 1 component (all connected)
    (iter (for (dist j1 j2) in edges)
      (while (> components 1))
      (when (uf-union uf j1 j2)
        ;; This edge merged two separate components
        (decf components)
        (setf last-j1 j1 last-j2 j2)))

    (* (j-x last-j1) (j-x last-j2))))
#+end_src

** Test

Let me verify this works with the example. For the 20 junction boxes in
=*example*=, we need 19 edges to connect them all. The last edge that merges two
components into one connects the junction boxes at (216, 146, 977) and (117,
168, 530). Their X coordinates are 216 and 117, so the answer is 216 × 117 =
25272.

#+begin_src lisp :results replace
(5a:test day08-2-test
  (5a:is (= 25272 (day08-2 *example*))))
#+end_src

#+RESULTS:
:
: Running test DAY08-2-TEST .
:  Did 1 check.
:     Pass: 1 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)

** Part two finished: Fri 19 Dec 2025 08:55:40 PM PST

** Reflections

This was a great learning experience! I went into this problem thinking "I'll
just track circuits with lists" and came out understanding why Union-Find is
such a fundamental data structure. It's now in my toolbox for any problem
involving connected components, cycle detection, or graph connectivity.

The key lessons:
- When you need to track "which group does this thing belong to?" and merge
  groups, reach for Union-Find
- Kruskal's algorithm + Union-Find is a powerful combination for MST problems
- Sometimes the "simple" approach (lists and set operations) isn't enough -
  you need the right data structure
- Reading the algorithm textbooks pays off!

