2025/Day08/Day08.html
<div id="outline-container-org38ff962" class="outline-3">
<h3 id="org38ff962"><span class="section-number-3">4.2.</span> Solution</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The code is almost the same as KRUSKAL, but instead of processing a fixed number
of edges, we process until there&rsquo;s only one component left. We track the
component count explicitly and decrement it each time we successfully merge.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orga9915a2"><code><span style="color: #c66;">(</span><span style="color: #00d3d0; font-weight: bold;">defun</span> <span style="color: #f78fe7;">day08-2</span> <span style="color: #6c6;">(</span>input<span style="color: #6c6;">)</span>
  <span style="color: #bfebe0; font-style: italic;">"Find the pair that connects all junction boxes into a single circuit.
   Return the product of the X coordinates of that pair."</span>
  <span style="color: #6c6;">(</span><span style="color: #00d3d0; font-weight: bold;">let*</span> <span style="color: #69f;">(</span><span style="color: #cc6;">(</span>junctions <span style="color: #6cc;">(</span>parse-input input<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>edges <span style="color: #6cc;">(</span>get-all-edges junctions<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>uf <span style="color: #6cc;">(</span>make-union-find<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>n <span style="color: #6cc;">(</span>length junctions<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>components n<span style="color: #cc6;">)</span>  <span style="color: #d0a070; font-style: italic;">; start with n separate components
</span>         <span style="color: #cc6;">(</span>last-j1 nil<span style="color: #cc6;">)</span>
         <span style="color: #cc6;">(</span>last-j2 nil<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>

    <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Initialize all nodes in union-find
</span>    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> j in-vector junctions<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span>uf-find uf j<span style="color: #cc6;">)</span><span style="color: #69f;">)</span>

    <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">Process edges until we have 1 component (all connected)
</span>    <span style="color: #69f;">(</span><span style="color: #00d3d0; font-weight: bold;">iter</span> <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">for</span> <span style="color: #6cc;">(</span>dist j1 j2<span style="color: #6cc;">)</span> in edges<span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">while</span> <span style="color: #6cc;">(</span>&gt; components 1<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span>
      <span style="color: #cc6;">(</span><span style="color: #00d3d0; font-weight: bold;">when</span> <span style="color: #6cc;">(</span>uf-union uf j1 j2<span style="color: #6cc;">)</span>
        <span style="color: #d0a070; font-style: italic;">;; </span><span style="color: #d0a070; font-style: italic;">This edge merged two separate components
</span>        <span style="color: #6cc;">(</span>decf components<span style="color: #6cc;">)</span>
        <span style="color: #6cc;">(</span>setf last-j1 j1 last-j2 j2<span style="color: #6cc;">)</span><span style="color: #cc6;">)</span><span style="color: #69f;">)</span>

    <span style="color: #69f;">(</span>* <span style="color: #cc6;">(</span>j-x last-j1<span style="color: #cc6;">)</span> <span style="color: #cc6;">(</span>j-x last-j2<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga642042" class="outline-3">
<h3 id="orga642042"><span class="section-number-3">4.3.</span> Test</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Let me verify this works with the example. For the 20 junction boxes in
<code>*example*</code>, we need 19 edges to connect them all. The last edge that merges two
components into one connects the junction boxes at (216, 146, 977) and (117,
168, 530). Their X coordinates are 216 and 117, so the answer is 216  117 =
</p>
<ol class="org-ol">
<li></li>
</ol>

<div class="org-src-container">
<pre class="src src-lisp"><code><span style="color: #c66;">(</span>5a:test day08-2-test
  <span style="color: #6c6;">(</span>5a:is <span style="color: #69f;">(</span>= 25272 <span style="color: #cc6;">(</span>day08-2 *example*<span style="color: #cc6;">)</span><span style="color: #69f;">)</span><span style="color: #6c6;">)</span><span style="color: #c66;">)</span>
</code></pre>
</div>

<pre class="example">

Running test DAY08-2-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
<div id="outline-container-orgf7727ec" class="outline-3">
<h3 id="orgf7727ec"><span class="section-number-3">4.4.</span> Part two finished: Fri 19 Dec 2025 08:55:40 PM PST</h3>
</div>

<div id="outline-container-orgac55621" class="outline-3">
<h3 id="orgac55621"><span class="section-number-3">4.5.</span> Reflections</h3>
<div class="outline-text-3" id="text-4-5">
<p>
This was a great learning experience! I went into this problem thinking &ldquo;I&rsquo;ll
just track circuits with lists&rdquo; and came out understanding why Union-Find is
such a fundamental data structure. It&rsquo;s now in my toolbox for any problem
involving connected components, cycle detection, or graph connectivity.
</p>

<p>
The key lessons:
</p>
<ul class="org-ul">
<li>When you need to track &ldquo;which group does this thing belong to?&rdquo; and merge
groups, reach for Union-Find</li>
<li>Kruskal&rsquo;s algorithm + Union-Find is a powerful combination for MST problems</li>
<li>Sometimes the &ldquo;simple&rdquo; approach (lists and set operations) isn&rsquo;t enough -
you need the right data structure</li>
<li>Reading the algorithm textbooks pays off!</li>
</ul>
</div>
</div>
</div>
