2025/Day08/Day08.org
* Run Solutions and Timings

Timings with SBCL on a Thinkpad X1 Carbon with Intel Core Ultra 7 and 32GB RAM running pop-os 24.04. Literate document created in Emacs 29.3 with org-babel. Solution created with help from Claude Code running Opus 4.5.

#+begin_src lisp solution-timings :results replace
;; now solve the puzzle!

(let ((*trace-output* *standard-output*))
  (time (format t "The answer to AOC 2025 Day 8 Part 1 is ~a"
                (day08-1 (uiop:read-file-lines *data-file*) 1000)))

(time (format t "The answer to AOC 2025 Day 8 Part 2 is ~a"
              (day08-2 (uiop:read-file-lines *data-file*)))))
#+end_src

#+RESULTS:
#+begin_example
The answer to AOC 2025 Day 8 Part 1 is 105952
Evaluation took:
  0.180 seconds of real time
  0.180223 seconds of total run time (0.173309 user, 0.006914 system)
  100.00% CPU
  596,115,473 processor cycles
  32,737,312 bytes consed

The answer to AOC 2025 Day 8 Part 2 is 975931446
Evaluation took:
  0.205 seconds of real time
  0.206116 seconds of total run time (0.202169 user, 0.003947 system)
  [ Run times consist of 0.037 seconds GC time, and 0.170 seconds non-GC time. ]
  100.49% CPU
  681,600,684 processor cycles
  32,700,560 bytes consed

#+end_example
